---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotProcessInStairsSketchEditMode
source: html/8e9daec7-25da-e984-db09-32730115cf16.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotProcessInStairsSketchEditMode Property

Cannot process when stair(s) in sketch edit mode.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotProcessInStairsSketchEditMode { get; }
```